v9/phaseChangeColumn/condensation/1x640/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \    /   O peration     | Website:  https://openfoam.org
   \  /    A nd           | Version:  9                                   
    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottom
    {
        type            noSlip;
    }

   
    top
    {
       type            pressureDirectedInletOutletVelocity;
       phi             phi; 
       inletDirection  uniform (0 -1 0);
       value           uniform (0 0 0);        

        
    }

    verticalWall
    {
        type            slip;
    }
    
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
