v9/phaseChangeColumn/condensation/1x640/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \    /   O peration     | Website:  https://openfoam.org
   \  /    A nd           | Version:  9                                   
    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField		uniform         1e5;

boundaryField
{
     top
    {
        type          prghTotalPressure;
        rho           rho;
        phi           phi;
        p0            $internalField; 
    }
     
    bottom
    {
        type          fixedFluxPressure;
        
    }
    
    verticalWall
    {
        type            fixedFluxPressure;
    }

     frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
