v9/phaseChangeColumn/condensation/1x640/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \    /   O peration     | Website:  https://openfoam.org
   \  /    A nd           | Version:  9                                   
    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (liquid vapour air);

phaseChangeThreePhaseMixture SchnerrSauer3;

pSat        99700;

liquid
{
    transportModel  Newtonian;
    nu         0.01;
    rho        1000;    
}

vapour
{
    transportModel  Newtonian;
    nu         0.1;
    rho        1;  
}

air
{
    transportModel  Newtonian;
    nu         0.1;
    rho        1;
}

SchnerrSauer3Coeffs
{
    n               1e+8;
    dNuc            1e-6;
    Cc              1;
    Cv              0;
}

sigma12         1.96;
sigma13         1.96; 
// ************************************************************************* //
