v9/phaseChangeColumn/condensation/1x640/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \    /   O peration     | Website:  https://openfoam.org
   \  /    A nd           | Version:  9                                   
    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        cAlpha          1;
        nAlphaCorr      2;
        nAlphaSubCycles 1;

        MULESCorr       yes;
        nLimiterIter    5;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-15;
        relTol          0;
        nsweeps         1;
        minIter         1;
    };

    U
    {
        solver          PBiCGStab;
	preconditioner  DILU;
        tolerance       1e-7;
        relTol          0;
    };

    UFinal
    {
        $U;
        relTol          0;
    }

    p_rgh
    {
        solver          PBiCGStab;
        tolerance       1e-9;
	preconditioner
        {
            preconditioner DIC;
            tolerance      1e-05;
            relTol         0;
            smoother    GaussSeidel;
            nPreSweeps     0;
            nPostSweeps    2;
            nFinestSweeps  2;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 10;
            agglomerator faceAreaPair;
            mergeLevels   1;
        }     
    };

    p_rghFinal
    {
        $p_rgh
        tolerance       1e-9;
        relTol          0;
    };

    "(pcorr|pcorrFinal)"
    {
        $p_rgh;
        relTol          0;
    };

    Phi
    {
        $p_rgh;
        relTol          0;
    };
}

potentialFlow
{
    nNonOrthogonalCorrectors   5;
}

PIMPLE
{
    momentumPredictor           on;
    nOuterCorrectors            25;
    nCorrectors                 3;
    nNonOrthogonalCorrectors    1;
    turbOnFinalIterOnly         on;
    outerCorrectorResidualControl
    {
        "(p_rgh)"
        {
            relTol          0;
            tolerance       1e-7;
        }
    }
    
    pRefPoint      (0.05 0.1 0);
    pRefValue      0;
}

relaxationFactors
{
    fields
    {
        p_rgh   1;
    }
    
    equations
    {
        U       1; 
    }
}

// ************************************************************************* //
